 [{
  "company": "Blackjet",
  "period": "2023 - 2024 · 1 yr 2 mos",
  "copy": "<p>Standout aspect of this full-stack role at this full-service Toronto agency were their exceptional, out-the-box, designs and the challenges and opportunities they presented in execution. Main deliverables included:</p><ul><li>advanced CSS animations and layouts,</li><li>full-stack Wordpress development,</li><li>HTML emails and</li><li>banner ads</li></ul><p>in a high-volume rapidly changing environment with often competing priorities, while deepening knowledge in modern build processes and backend development.</p>"
},{
  "company": "Innocean Canada",
  "period": "2021 - 2022 · 1 yr 2 mos",
  "copy": "<p>Member of the digital delivery team for Innocean, a global advertising agency, supporting marketing verticals with (but not limited to)</p><ul><li>advanced email development,</li><li>dynamic banners and</li><li>lead ads</li></ul><p>for the automotive industry, as well as providing guidance, solutions and best options, for fellow developers and non-technical colleagues, to clear project blockers, across teams and departments.</p>"
},{
  "company": "Wave Financial",
  "period": "2016 - 2020 · 4 yrs",
  "copy": "<p>Contributed to and maintained an in-house styles and components library, developing in <ul><li>HTML/CSS/SASS,</li><li>Django,</li><li>Python and</li><li>WordPress (for the blog)</ul> for their public facing website, shared with their application framework.</p><p>Later migrated waveapps.com to</p><ul><li>Craft CMS and Bootstrap,</li><li>JQuery,</li><li>React (for mini financial apps)</li></ul><p>to meet the rapidly growing needs of Marketing. This developed knowledge in &ldquo;systems thinking&rdquo; and fullstack development with Craft, in addition to A/B testing, user analytics tools, accessibility and modern SEO practices.</p>"
}, {
  "company": "Forge Media + Design",
  "period": "2015 - 2016 · 1 yr 2 mos",
  "copy": "<p>The front-end role here was divided into</p><ul><li>full-stack WordPress development (backend was new to me) and </li><li>supporting a fortune 500 company website,</li></ul> <p>implementing and debugging GEO specific content.</p><p>The later pushed the limits of working quickly and accurately, communication and required advanced abilities in debugging and creativity in code, for at times 70+ tickets, between several remote teams, for the cutting-edge content, layouts and delivery methods.</p>"
}, {
  "company": "Splash Interactive",
  "period": "2005 - 2015 · 9 yrs 8 mos",
  "copy": "<p>Front-end developer + project coordinator (but this came later), provided support and training for clients and supporting third party vendors.</p><p>Development consisted of</p><ul><li>mostly hand-coding website interfaces in</li><li>HTML, CSS and a little JavaScript,</li><li>WordPress and Magento (12+ websites),</li><li>HTML emails,</li><li>Flash animations,</li><li>audio and video editing,</li><li>epubs,</li></ul><p>estimating timelines and working closely with designers, providing technical guidance and best options.<p></p>Coordinating involved, but not limited to, tracking all project details, adhering to timelines, liasing with clients and supporting backend developers, with QA, art direction and usability, for desktop, mobile and application development.</p><p>Splash Interactive provides digital and creative solutions to Fortune 500 companies, philanthropic organizations, and some of North America's top advertising agencies.</p>"
}]